app/Controllers/api/PendingTransactions.php

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE DATE_FORMAT(transactions.date_and_time_filed,'%Y-%m') = '2024-05'
AND `number` = '114'
---
                    'number'                => $data['number']
            );

            $verify =  $this->TransactionModel->verify_pmas_number($array_where)->countAllResults();