app/Models/CustomModel.php

SELECT *
FROM `users`
WHERE `user_type` != "admin"
---
        public function getReferto(){

        $builder = $this->db->table('users');
        $builder->where('user_type != "admin"');
        $query = $builder->get()->getResult();