app/Models/RFAModel.php

SELECT *
FROM `rfa_transactions`
JOIN `users` ON `users`.`user_id` = `rfa_transactions`.`rfa_created_by`
JOIN `type_of_request` ON `type_of_request`.`type_of_request_id` = `rfa_transactions`.`tor_id`
WHERE `rfa_transactions`.`rfa_status` = 'pending'
ORDER BY `rfa_transactions`.`rfa_date_filed` DESC
 LIMIT 10
---
        public function getAdminPendingRFALimit(){

        $builder = $this->db->table('rfa_transactions');
        // $builder->join('rfa_clients','rfa_clients.rfa_client_id = rfa_transactions.client_id');

        $builder->join('users','users.user_id = rfa_transactions.rfa_created_by');
        $builder->join('type_of_request','type_of_request.type_of_request_id = rfa_transactions.tor_id');
        $builder->where('rfa_transactions.rfa_status','pending');

        $builder->orderBy('rfa_transactions.rfa_date_filed','desc');
        $builder->limit(10);
        $query = $builder->get()->getResult();