app/Models/TransactionModel.php

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE MONTH(date_and_time_filed) = 1
AND YEAR(date_and_time_filed) = '2024'
AND `transactions`.`transaction_status` = 'completed'
---
    public function count_transaction_chart($table,$m,$y,$status){

        $builder = $this->db->table('transactions');
        $builder->where('MONTH(date_and_time_filed)',$m);
        $builder->where('YEAR(date_and_time_filed)',$y);
        $builder->where('transactions.transaction_status',$status);
        $query = $builder->countAllResults();

SELECT *
FROM `transactions`
LEFT JOIN `responsible_section` ON `responsible_section`.`responsible_section_id` = `transactions`.`responsible_section_id`
JOIN `type_of_activities` ON `type_of_activities`.`type_of_activity_id` = `transactions`.`type_of_activity_id`
LEFT JOIN `responsibility_center` ON `responsibility_center`.`responsibility_center_id` = `transactions`.`responsibility_center_id`
JOIN `users` ON `users`.`user_id` = `transactions`.`created_by`
LEFT JOIN `cso` ON `cso`.`cso_id` = `transactions`.`cso_Id`
WHERE `transactions`.`transaction_status` = 'pending'
AND `transactions`.`created_by` = '9'
ORDER BY `transactions`.`number` DESC
---
    public function getUserPendingTransactions($where){

         $builder = $this->db->table('transactions');
        $builder->join('responsible_section','responsible_section.responsible_section_id = transactions.responsible_section_id','left');
        $builder->join('type_of_activities','type_of_activities.type_of_activity_id = transactions.type_of_activity_id');
        $builder->join('responsibility_center','responsibility_center.responsibility_center_id = transactions.responsibility_center_id','left');
        $builder->join('users','users.user_id = transactions.created_by');
        $builder->join('cso','cso.cso_id = transactions.cso_Id','left');
        $builder->where('transactions.transaction_status','pending');
        $builder->where('transactions.created_by',$where['created_by']);
        $builder->orderBy('transactions.number','desc');
        $query = $builder->get()->getResult();